app/Controllers/Productos.php

SELECT *
FROM `productos`
SELECT `talle`, `cantidad`
FROM `stocks`
WHERE `producto_id` = '3'
AND `cantidad` > 0
---
    public function index()
    {
        $productoModel = new ProductoModel();
        $stockModel = new StockModel();

        $productos = $productoModel->findAll();

        foreach ($productos as &$prod) {
            $stock = $stockModel
                ->select('talle, cantidad')
                ->where('producto_id', $prod['id'])
                ->where('cantidad >', 0)
                ->findAll();