app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `email` = 'admin@123.com'
 LIMIT 1
---
    public function verificarUsuario($email, $password)
    {
        $usuario = $this->where('email', $email)->first();